FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBHost.c
/*-------------------------------------------------------------------------*
 * File:  LPC1756_USBHost.c
 *-------------------------------------------------------------------------*
 * Description:
 *      <DESCRIPTION>
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
/*
 *  @{
 *  @brief     uEZ USB Host Interface
 *  @see http://goo.gl/UDtTCR/
 *  @see http://goo.gl/UDtTCR/files/uEZ License.pdf
 *
 *    HAL implementation of the LPC1756 USBHost Interface as pulled
 *      from NXP's USB Host Stack.
 * Implementation:
 *      This implementation still assumes that there is one major form
 *      of communication needed.  Descriptors are described and allocated
 *      by the next level up.
 *
 * @par Example code:
 * Example task to 
 * @par
 * @code
 * #include <uEZ.h>
 * TODO
 * @endcode
 */
#include <Config.h>

/*---------------------------------------------------------------------------*
 * Include Files:
 *---------------------------------------------------------------------------*/
#include <uEZ.h>
#include <uEZProcessor.h>
#include <Source/Processor/NXP/LPC1756/LPC1756_USBHost.h>

/*---------------------------------------------------------------------------*
 * Registers:
 *---------------------------------------------------------------------------*/
#define USB_INT_BASE_ADDR	0xE01FC1C0
#define USB_INT_STAT    (SC->USBIntSt)

#define TIMEOUT_STANDARD        10000   // 10 SECONDS

/*---------------------------------------------------------------------------*
 * Macros and Constants:
 *---------------------------------------------------------------------------*/

/* ------------------ HcControl Register ---------------------  */
#define  OR_CONTROL_CLE                 0x00000010
#define  OR_CONTROL_BLE                 0x00000020
#define  OR_CONTROL_HCFS                0x000000C0
#define  OR_CONTROL_HC_OPER             0x00000080
/* ----------------- HcCommandStatus Register ----------------- */
#define  OR_CMD_STATUS_HCR              0x00000001
#define  OR_CMD_STATUS_CLF              0x00000002
#define  OR_CMD_STATUS_BLF              0x00000004
/* --------------- HcInterruptStatus Register ----------------- */
#define  OR_INTR_STATUS_WDH             0x00000002
#define  OR_INTR_STATUS_RHSC            0x00000040
/* --------------- HcInterruptEnable Register ----------------- */
#define  OR_INTR_ENABLE_WDH             0x00000002
#define  OR_INTR_ENABLE_RHSC            0x00000040
#define  OR_INTR_ENABLE_MIE             0x80000000
/* ---------------- HcRhDescriptorA Register ------------------ */
#define  OR_RH_STATUS_LPSC              0x00010000
/* -------------- HcRhPortStatus[1:NDP] Register -------------- */
#define  OR_RH_PORT_CCS                 0x00000001
#define  OR_RH_PORT_PRS                 0x00000010
#define  OR_RH_PORT_CSC                 0x00010000
#define  OR_RH_PORT_PRSC                0x00100000

#define  FI                     0x2EDF           /* 12000 bits per frame (-1)                               */
#define  DEFAULT_FMINTERVAL     ((((6 * (FI - 210)) / 7) << 16) | FI)

// Transfer Descriptor control fields
#define  TD_ROUNDING        (TUInt32) (0x00040000)        /* Buffer Rounding                             */
#define  TD_SETUP           (TUInt32)(0)                  /* Direction of Setup Packet                   */
#define  TD_IN              (TUInt32)(0x00100000)         /* Direction In                                */
#define  TD_OUT             (TUInt32)(0x00080000)         /* Direction Out                               */
#define  TD_DELAY_INT(x)    (TUInt32)((x) << 21)          /* Delay Interrupt                             */
#define  TD_TOGGLE_0        (TUInt32)(0x02000000)         /* Toggle 0                                    */
#define  TD_TOGGLE_1        (TUInt32)(0x03000000)         /* Toggle 1                                    */
#define  TD_CC              (TUInt32)(0xF0000000)         /* Completion Code                             */

/*---------------------------------------------------------------------------*
 * Macros:
 *---------------------------------------------------------------------------*/
#define  DESC_LENGTH(x)  x[0]
#define  DESC_TYPE(x)    x[1]


/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/

typedef struct {
    const HAL_USBHost *iHAL;

    TUInt8 *iAllocBase;
    TUInt32 iAllocRemaining;
    TUInt8 *iResetAllocBase;
    TUInt32 iResetAllocRemaining;

    volatile TUInt32 *iPortStatus;
    volatile T_usbHostDeviceState iState;

    // Callbacks
    const T_USBHostCallbacks *iCallbackAPI;
    void *iCallbackWorkspace;
} T_LPC1756_USBHost_Workspace;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static void IHost_TDInit (volatile  HCTD *td);
static void IHost_EDInit (volatile  HCED *aEndDesc);
static void IHost_HCCAInit (volatile  HCCA  *hcca);
static void *IAllocBuffer(
        T_LPC1756_USBHost_Workspace *p,
        TUInt32 aBufferSize);
static void  Host_DelayUS (TUInt32  delay);
void  WriteLE16U (volatile  TUInt8  *pmem,
                            TUInt16   val);
extern void UEZBSPDelayMS(uint32_t aMilliseconds);

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
//volatile  TUInt32   HOST_RhscIntr = 0;         /* Root Hub Status Change interrupt                       */
static volatile  TUInt32   HOST_WdhIntr  = 0;         /* Semaphore to wait until the TD is submitted            */
static volatile  HCED      *EDCtrl;                    /* Control endpoint descriptor structure                  */
static volatile  HCED      *EDBulkIn;                  /* BulkIn endpoint descriptor  structure                  */
static volatile  HCED      *EDBulkOut;                 /* BulkOut endpoint descriptor structure                  */
static volatile  HCTD      *TDHead;                    /* Head transfer descriptor structure                     */
static volatile  HCTD      *TDTail;                    /* Tail transfer descriptor structure                     */
static volatile  HCCA      *Hcca;                      /* Host Controller Communications Area structure          */
static volatile  TUInt8  *TDBuffer;                  /* Current Buffer Pointer of transfer descriptor          */
//static volatile  TUInt8  *UsbXferBuffer;             /* Buffer used by application                             */

//static int32_t G_usbHostInit = 0;
static T_LPC1756_USBHost_Workspace *G_usbHostWorkspace = 0;

