FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBHost.c
/*
**************************************************************************************************************
*                                         DELAY IN MILLI SECONDS
*
* Description: This function provides a delay in milli seconds
*
* Arguments  : delay    The delay required
*
* Returns    : None
*
**************************************************************************************************************
*/

// TBD: What should we do with this routine, we're in a HAL, but later and need a good delay
// that is not RTOS dependentant!  Probably not good to use timer 3?
static void  Host_DelayMS (TUInt32  delay)
{
    volatile  TUInt32  i;


    for (i = 0; i < delay; i++) {
        Host_DelayUS(1000);
    }
}

/*
**************************************************************************************************************
*                                         DELAY IN MICRO SECONDS
*
* Description: This function provides a delay in micro seconds
*
* Arguments  : delay    The delay required
*
* Returns    : None
*
**************************************************************************************************************
*/

static void  Host_DelayUS (TUInt32  delay)
{
    volatile  TUInt32  i;
    /* This logic was tested. It gives app. 1 micro sec delay        */
    for (i = 0; i < (4 * delay); i++) {
        ;
    }
}

/*
**************************************************************************************************************
*                                         INTERRUPT SERVICE ROUTINE
*
* Description: This function services the interrupt caused by host controller
*
* Arguments  : None
*
* Returns    : None
*
**************************************************************************************************************
*/

static void Host_Isr_Process (T_LPC1756_USBHost_Workspace *p)
{
    TUInt32   int_status;
    TUInt32   ie_status;

    if ((USB_INT_STAT & 0x00000008) > 0) {
        int_status    = USB->HcInterruptStatus;                          /* Read Interrupt Status                */
        ie_status     = USB->HcInterruptEnable;                          /* Read Interrupt enable status         */

        if (!(int_status & ie_status)) {
            return;
        } else {
            int_status = int_status & ie_status;

            if (int_status & OR_INTR_STATUS_RHSC) {                 /* Root hub status change interrupt     */
                if (*(p->iPortStatus) & OR_RH_PORT_CSC) {             // ConnectStatusChange--> 0 = no change
                    if (*(p->iPortStatus) & OR_RH_PORT_CCS) {         // CurrentConnectStatus--> 1 = device connected
                        p->iState = USB_HOST_STATE_CONNECTED;

                        // Use connect callback (if one is available)
                        if (p->iCallbackAPI)
                            if (p->iCallbackAPI->Connected)
                                p->iCallbackAPI->Connected(p->iCallbackWorkspace);
                    } else {
                        p->iState = USB_HOST_STATE_DISCONNECTED;

                        // Use disconnect callback (if one is available)
                        if (p->iCallbackAPI)
                            if (p->iCallbackAPI->Disconnected)
                                p->iCallbackAPI->Disconnected(p->iCallbackWorkspace);
                    }
                    *(p->iPortStatus) = OR_RH_PORT_CSC;                  // clear CSC interrupt bit
                }
                if (*(p->iPortStatus) & OR_RH_PORT_PRSC) {           //PortResetStatusChange--> 1 = port reset complete
                    *(p->iPortStatus) = OR_RH_PORT_PRSC;
                }
            }
            if (int_status & OR_INTR_STATUS_WDH) {                  /* Writeback Done Head interrupt        */
                HOST_WdhIntr = 1;
            }
            USB->HcInterruptStatus = int_status;                         /* Clear interrupt status register      */
        }
    }
}

void LPC1756_InterruptProcess_USBHost(void)
{
    if (G_usbHostWorkspace)
        Host_Isr_Process(G_usbHostWorkspace);
}

/*
**************************************************************************************************************
*                                          FILL SETUP PACKET
*
* Description: This function is used to fill the setup packet
*
* Arguments  : None
*
* Returns    : OK		              if Success
*              ERR_INVALID_BOOTSIG    if Failed
*
**************************************************************************************************************
*/

/*---------------------------------------------------------------------------*
 * Routine:  IHost_FillSetup
 *---------------------------------------------------------------------------*/
/**
 *  Fill a setup packet
 *
 *  @param [in]    *p			   USB Host controller workspace
 *
 *  @param [in]    aBMRequestType  Type of request
 *
 *  @param [in]    aRequest        Request
 *
 *  @param [in]    aValue          Value for request
 *
 *  @param [in]    aIndex          Index for request
 *
 *  @param [in]    aLength         Length of data in command
 *
 *  @return        *void           Returned allocation, or 0 for out of memory.
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void IHost_FillSetup(
        T_LPC1756_USBHost_Workspace *p,
        TUInt8   aBMRequestType,
        TUInt8   aRequest,
        TUInt16   aValue,
        TUInt16   aIndex,
        TUInt16   aLength)
{
    TDBuffer[0] = aBMRequestType;
    TDBuffer[1] = aRequest;
    WriteLE16U(&TDBuffer[2], aValue);
    WriteLE16U(&TDBuffer[4], aIndex);
    WriteLE16U(&TDBuffer[6], aLength);
}



/*
**************************************************************************************************************
*                                         INITIALIZE THE TRANSFER DESCRIPTOR
*
* Description: This function initializes transfer descriptor
*
* Arguments  : Pointer to TD structure
*
* Returns    : None
*
**************************************************************************************************************
*/
static void IHost_TDInit(volatile  HCTD *td)
{
    td->Control    = 0;
    td->CurrBufPtr = 0;
    td->Next       = 0;
    td->BufEnd     = 0;
}

