FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_USBHost.c
/*
**************************************************************************************************************
*                                         INITIALIZE THE ENDPOINT DESCRIPTOR
*
* Description: This function initializes endpoint descriptor
*
* Arguments  : Pointer to ED strcuture
*
* Returns    : None
*
**************************************************************************************************************
*/
static void IHost_EDInit (volatile  HCED *aEndDesc)
{
    aEndDesc->Control = 0;
    aEndDesc->TailTd  = 0;
    aEndDesc->HeadTd  = 0;
    aEndDesc->Next    = 0;
}

/*
**************************************************************************************************************
*                                 INITIALIZE HOST CONTROLLER COMMUNICATIONS AREA
*
* Description: This function initializes host controller communications area
*
* Arguments  : Pointer to HCCA
*
* Returns    :
*
**************************************************************************************************************
*/
static void IHost_HCCAInit (volatile  HCCA  *hcca)
{
    TUInt32  i;

    for (i = 0; i < 32; i++) {
        hcca->IntTable[i] = 0;
        hcca->FrameNumber = 0;
        hcca->DoneHead    = 0;
    }
}

/*
**************************************************************************************************************
*                                         WAIT FOR WDH INTERRUPT
*
* Description: This function is infinite loop which breaks when ever a WDH interrupt rises
*
* Arguments  : None
*
* Returns    : None
*
**************************************************************************************************************
*/
#if 0
static T_uezError IHost_WDHWait (TUInt32 aTimeout)
{
#if 0
    T_uezError error = UEZ_ERROR_NONE;
    while ((!HOST_WdhIntr) && (aTimeout > 10)) {
        UEZBSPDelayMS(10);
        if (aTimeout > 10) {
            aTimeout -= 10;
        } else {
            error = UEZ_ERROR_TIMEOUT;
            break;
        }
    }
    HOST_WdhIntr = 0;
    return error;
#else
    while ((!HOST_WdhIntr) && (p->iState == USB_HOST_STATE_CONNECTED)) {
    }
    HOST_WdhIntr = 0;
    return UEZ_ERROR_NONE;
#endif
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  IAllocBuffer
 *---------------------------------------------------------------------------*/
/**
 *  Allocate data in the USB Data area (if room for allocation)
 *
 *  @param [in]    *p 			   USB Host controller workspace
 *
 *  @param [in]    aBufferSize     Number of bytes required
 *
 *  @return        *void           Returned allocation, or 0 for out of memory.
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static void *IAllocBuffer(
        T_LPC1756_USBHost_Workspace *p,
        TUInt32 aBufferSize)
{
    void *p_buffer = p->iAllocBase;

    // Determine if there is enough room
    if (p->iAllocRemaining < aBufferSize)
        return 0;

    // There is enough room
    // Move the base to the next location
    // and mark off the space used
    p->iAllocBase += aBufferSize;
    p->iAllocRemaining -= aBufferSize;

    // Return the original base address
    return p_buffer;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_AllocBuffer
 *---------------------------------------------------------------------------*
 * Description:
 *      Allocate USB memory.
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      TUInt32 aSize               -- Number of bytes required
 * Outputs:
 *      void *                      -- Returned allocation, or 0 for out
 *                                      of memory.
 *---------------------------------------------------------------------------*/
static void *Host_AllocBuffer(void *aWorkspace, TUInt32 aSize)
{
    T_LPC1756_USBHost_Workspace *p = (T_LPC1756_USBHost_Workspace *)aWorkspace;
    return IAllocBuffer(p, aSize);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_USBHost_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the USB Host to work on Port A
 *
 *  @param [in]    *aWorkspace       USB Host controller workspace
 *
 *  @param [in]    T_uezError        Any error if failed
 *=
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError LPC1756_USBHost_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_USBHost_Workspace *p = (T_LPC1756_USBHost_Workspace *)aWorkspace;
    p->iPortStatus = (volatile TUInt32 *)&USB->HcRhPortStatus1;
    p->iAllocRemaining = 0; // Not ready yet
    p->iCallbackAPI = 0;
    p->iCallbackWorkspace = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_Init
 *---------------------------------------------------------------------------*/
/**
 *  Initializes the LPC1756 host controller with buffers
 *
 *  @param [in]    *aWorkspace   	USB Host controller workspace
 *
 *  @return        T_uezError    	Any error if failed
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
static T_uezError Host_Init(void *aWorkspace)
{
    extern void USBSharedInterruptSetup(void);
    T_LPC1756_USBHost_Workspace *p = (T_LPC1756_USBHost_Workspace *)aWorkspace;

    // Setup memory from start
    p->iAllocBase = (TUInt8 *)(AHBSRAM0_BASE+8192+2*1024);
    p->iAllocRemaining = 6*1024;

    // Ensure power to the USB is on
    SC->PCONP         |= (1UL<<31);

    // Enable the USB interrupt source
    USB->u1.OTGClkCtrl = 0x0000001B;

    while ((USB->u2.OTGClkSt & 0x0000001B) != 0x1B) {
        ;
    }

    USB->OTGStCtrl = 0x00000003;

    // Allocate standard buffers
    Hcca       = IAllocBuffer(p, sizeof(HCCA));
    TDHead     = IAllocBuffer(p, sizeof(HCTD));
    TDTail     = IAllocBuffer(p, sizeof(HCTD));
    EDCtrl     = IAllocBuffer(p, sizeof(HCED));
    EDBulkIn   = IAllocBuffer(p, sizeof(HCED));
    EDBulkOut  = IAllocBuffer(p, sizeof(HCED));
    TDBuffer   = IAllocBuffer(p, 128);

    // And then initialize those buffers
    IHost_EDInit(EDCtrl);
    IHost_EDInit(EDBulkIn);
    IHost_EDInit(EDBulkOut);
    IHost_TDInit(TDHead);
    IHost_TDInit(TDTail);
    IHost_HCCAInit(Hcca);

